"""
    算数运算符 ：
                +
                -
                *
                /
                **   平方运算符
                %   取余运算符
                //  取整运算符
"""
print(2**10)  # 3^10
print(10%2)  #判断奇数偶数
print(3//2)

"""
    比较运算符 
                >
                < 
                >=
                <=
                ==
                !=
"""
print(3>2)


"""
    逻辑运算符  ：
                    逻辑与   and
                    逻辑或   or
                    逻辑非   not 
"""
print(True and False)
print(1>2 and 3<2)
print(1>2 or 3>2)
print(not(1>2 or 3>2))

"""
    赋值运算符 
                = 
                +=
                -= 
                /=
                *=
                **=
                %=
                //=
"""
a = 1
a +=10
print(a)
"""
    位运算符  | & ~ <<  >> (几乎不会用到)
"""